BenchBnB/app/controllers/api/benches_controller.rb

    def create
        @bench = Bench.new(bench_params);
        if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "A nice bench by the beach"], ["lat", 37.78792], ["lng", -122.505611], ["created_at", "2020-09-17 15:34:46.658985"], ["updated_at", "2020-09-17 15:34:46.658985"]]