BenchBnB/app/models/bench.rb

    def self.in_bounds(bounds)
        return [] if !bounds
        benches = Bench.all;
        benches.select do |bench|
---
SELECT "benches".* FROM "benches"